In [5]:
import pandas as pd

In [6]:
film={'film-name':['arya','abcd'],
     'hero':['bunny','shirish'],
     'heroin':['kajal','rukshar']
     }

In [7]:
film

{'film-name': ['arya', 'abcd'],
 'hero': ['bunny', 'shirish'],
 'heroin': ['kajal', 'rukshar']}

In [8]:
data=pd.DataFrame(film,index=[1,2])

In [9]:
data

  film-name     hero   heroin
1      arya    bunny    kajal
2      abcd  shirish  rukshar

In [10]:
df=data.assign(director=['sukumar','sanjeev'])

In [11]:
df

  film-name     hero   heroin director
1      arya    bunny    kajal  sukumar
2      abcd  shirish  rukshar  sanjeev

In [12]:
df2={'film-name':'pk','hero':'aamir','heroin':'anushka','director':'xyz'}

In [13]:
df2

{'director': 'xyz', 'film-name': 'pk', 'hero': 'aamir', 'heroin': 'anushka'}

In [14]:
d=pd.DataFrame(df2,index=[3])

In [15]:
d

  director film-name   hero   heroin
3      xyz        pk  aamir  anushka

In [16]:
l=df.append(d)

/home/swecha/.local/lib/python3.5/site-packages/pandas/core/frame.py:6692: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  sort=sort)

In [17]:
l

  director film-name     hero   heroin
1  sukumar      arya    bunny    kajal
2  sanjeev      abcd  shirish  rukshar
3      xyz        pk    aamir  anushka

In [18]:
l=l.reset_index()

In [19]:
l

   index director film-name     hero   heroin
0      1  sukumar      arya    bunny    kajal
1      2  sanjeev      abcd  shirish  rukshar
2      3      xyz        pk    aamir  anushka

In [18]:
k=l.assign(collections=[25,30,50])

In [20]:
del l['index']

In [21]:
l

  director film-name     hero   heroin
0  sukumar      arya    bunny    kajal
1  sanjeev      abcd  shirish  rukshar
2      xyz        pk    aamir  anushka

In [19]:
k

  director film-name     hero   heroin  collections
1  sukumar      arya    bunny    kajal           25
2  sanjeev      abcd  shirish  rukshar           30
3      xyz        pk    aamir  anushka           50

In [20]:
b=k['collections']>20

In [21]:
b

1    True
2    True
3    True
Name: collections, dtype: bool

In [22]:
b[k['film-name']]

film-name
arya    NaN
abcd    NaN
pk      NaN
Name: collections, dtype: object

In [23]:
k[k['collections']<30]

  director film-name   hero heroin  collections
1  sukumar      arya  bunny  kajal           25

In [24]:
k.drop(2)

  director film-name   hero   heroin  collections
1  sukumar      arya  bunny    kajal           25
3      xyz        pk  aamir  anushka           50

In [25]:
college={'dept_name':['CSE','EEE','ECE','MECH','IT'],
        'total_strength':[50,30,40,20,60],
        'appeared_for-exam':[50,29,20,58,30],
        'total_passed':[45,25,15,55,34]}

In [26]:
college

{'appeared_for-exam': [50, 29, 20, 58, 30],
 'dept_name': ['CSE', 'EEE', 'ECE', 'MECH', 'IT'],
 'total_passed': [45, 25, 15, 55, 34],
 'total_strength': [50, 30, 40, 20, 60]}

In [27]:
import pandas as pd

In [28]:
j=pd.DataFrame(college,index=[1,2,3,4,5])

In [29]:
j

   appeared_for-exam dept_name  total_passed  total_strength
1                 50       CSE            45              50
2                 29       EEE            25              30
3                 20       ECE            15              40
4                 58      MECH            55              20
5                 30        IT            34              60

In [72]:
z=j['total_strength'].min()

In [73]:
z

20

In [90]:
c=j['dept_name']=min('total_strength')

In [85]:
c

1    False
2    False
3    False
4    False
5    False
Name: dept_name, dtype: bool

In [83]:
c

array([False, False, False, False, False])

In [34]:
j.describe()

       appeared_for-exam  total_passed  total_strength
count           5.000000      5.000000        5.000000
mean           37.400000     34.800000       40.000000
std            15.899686     15.817712       15.811388
min            20.000000     15.000000       20.000000
25%            29.000000     25.000000       30.000000
50%            30.000000     34.000000       40.000000
75%            50.000000     45.000000       50.000000
max            58.000000     55.000000       60.000000

In [35]:
m=j.assign(Hod_name=['kalpa','sravs','asha','jyothi','thanmai'])

In [36]:
m

   appeared_for-exam dept_name  total_passed  total_strength Hod_name
1                 50       CSE            45              50    kalpa
2                 29       EEE            25              30    sravs
3                 20       ECE            15              40     asha
4                 58      MECH            55              20   jyothi
5                 30        IT            34              60  thanmai

In [37]:
m['color']=['blue','pink','black','black','cyan']

In [38]:
m

   appeared_for-exam dept_name  total_passed  total_strength Hod_name  color
1                 50       CSE            45              50    kalpa   blue
2                 29       EEE            25              30    sravs   pink
3                 20       ECE            15              40     asha  black
4                 58      MECH            55              20   jyothi  black
5                 30        IT            34              60  thanmai   cyan

In [39]:
m['total_strength'].min()

20

In [40]:
m.groupby('color')

In [41]:
s=m['total_passed']

In [42]:
s

1    45
2    25
3    15
4    55
5    34
Name: total_passed, dtype: int64

In [43]:
u=m['appeared_for-exam']

In [44]:
u

1    50
2    29
3    20
4    58
5    30
Name: appeared_for-exam, dtype: int64

In [45]:
i=m['total_passed'].sum()

In [46]:
i

174

In [47]:
b=m['appeared_for-exam'].sum()

In [48]:
b

187

In [49]:
h=i/b

In [50]:
h

0.93048128342246

In [51]:
h*100

93.04812834224599

In [52]:
import cufflinks as cf

In [53]:
import plotly

In [54]:
m['total_passed'].iplot(kind='bar')

In [55]:
m['total_strength'].iplot(kind='histogram')

In [56]:
m['appeared_for-exam'].iplot(kind='scatter')